<a href="https://colab.research.google.com/github/Chaqmoqjon/Pandas/blob/main/2_Dic_Methods.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd
import numpy as np

In [ ]:
dic_cars = {'Malibu': 40000, "Lacetti": 20000, "Damas" : 10000, "Spark" : 5000}
dic_cars

{'Malibu': 40000, 'Lacetti': 20000, 'Damas': 10000, 'Spark': 5000}

In [ ]:
type(dic_cars)

dict

In [ ]:
dic1 = pd.Series(dic_cars)
dic1

Malibu     40000
Lacetti    20000
Damas      10000
Spark       5000
dtype: int64

In [ ]:
type(dic1)

pandas.core.series.Series

In [ ]:
"Malibu" in dic1

True

In [ ]:
"BMW" in dic1

False

In [ ]:
dic1['Damas']

10000

In [ ]:
dic1

Malibu     40000
Lacetti    20000
Damas      10000
Spark       5000
dtype: int64

In [ ]:
models = ['Lacetti', "Tesla", 'Damas', 'Malibu', 'BMW']

dic2 = pd.Series(dic_cars, index= models)
dic2

Lacetti    20000.0
Tesla          NaN
Damas      10000.0
Malibu     40000.0
BMW            NaN
dtype: float64

In [ ]:
dic2.isnull()

Lacetti    False
Tesla       True
Damas      False
Malibu     False
BMW         True
dtype: bool

In [ ]:
dic2.notnull()

Lacetti     True
Tesla      False
Damas       True
Malibu      True
BMW        False
dtype: bool

In [ ]:
dic1 + dic2

BMW            NaN
Damas      20000.0
Lacetti    40000.0
Malibu     80000.0
Spark          NaN
Tesla          NaN
dtype: float64

In [ ]:
dic2.name = "Avtosalon"
dic2.index.name = 'Modellar'
dic2

Modellar
Lacetti    20000.0
Tesla          NaN
Damas      10000.0
Malibu     40000.0
BMW            NaN
Name: Avtosalon, dtype: float64